# -*- coding: utf-8 -*-

# Создать пакет, в который скопировать функции отрисовки из предыдущего урока
#  - радуги
#  - стены
#  - дерева
#  - смайлика
#  - снежинок
# Функции по модулям разместить по тематике. Название пакета и модулей - по смыслу.
# Создать модуль с функцией отрисовки кирпичного дома с широким окном и крышей.

# С помощью созданного пакета нарисовать эпохальное полотно "Утро в деревне".
# На картине должны быть:
#  - кирпичный дом, в окошке - смайлик.
#  - слева от дома - сугроб (предположим что это ранняя весна)
#  - справа от дома - дерево (можно несколько)
#  - справа в небе - радуга, слева - солнце (весна же!)
# пример см. lesson_005/results/04_painting.jpg
# Приправить своей фантазией по вкусу (коты? коровы? люди? трактор? что придумается)
from epoch_canvas.animation import go_sun
from epoch_canvas.house import draw_house
from epoch_canvas.nature import snowdrift, grass, draw_tree, sun, rainbow

import simple_draw as sd

sd.resolution = (1200, 900)
sd.caption = 'Epoch canvas'
sd.background_color = (135, 206, 235)
sd.start_drawing()
draw_house(_x=330, _y=10)
grass()
snowdrift()
draw_tree(850)
draw_tree(1000, 10)
sun(_delta=12)
rainbow()
sd.finish_drawing()
go_sun(12)
sd.pause()

# Усложненное задание (делать по желанию)
# Анимировать картину.
# Пусть слева идет снегопад, радуга переливается цветами, смайлик моргает, солнце крутит лучами, етс.
# Задержку в анимировании все равно надо ставить, пусть даже 0.01 сек - так библиотека устойчивей работает.
