# -*- coding: utf-8 -*-


def add_bun():
    print('А теперь добавим булочку для гамбургеров, поджареннюу в тостере')


def add_patty():
    print('А теперь добавим бифштекс из говядины рубленые, приготовленные на гриле')


def add_pickle():
    print('А теперь добавим огурцы маринованные резанные')


def add_tomato():
    print('А теперь добавим помидор свежий резаный')


def add_souce():
    print('А теперь добавим дижонский майонез')


def add_cheese():
    print('А теперь добавим плавленый сыр Чеддер')


def add_grill():
    print('А теперь добавим приправу для гриля')


def add_onion():
    print('А теперь добавим лук репчатый свежий резаный')


def add_mustard():
    print('А теперь добавим горчичный соус')


def add_ketchup():
    print('А теперь добавим кетчуп')
